app/Http/Controllers/User/HistoryController.php

select * from `doctor_appointments` where `user_id` = 1 limit 6 offset 0
select * from `doctors` where `doctors`.`id` in (2, 3, 4, 5)
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `doctor_appointments` where `user_id` = 1
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
    public function index(){
        $breadcrumb    = "History";
        $page_title    = "| User History";
        $booking       = DoctorAppointment::with(['doctors','schedules','user'])->where('user_id',auth::user()->id)->paginate(6);
        $user          = auth()->user();
        $notifications = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();

select * from `doctor_appointments` where `slug` = '5031b63c-52b4-4e8b-be3a-337072dc3232' limit 1
select * from `doctors` where `doctors`.`id` in (4)
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
    public function bookingDetails($slug){
        $page_title    = "| Booking Details";
        $breadcrumb    = "Booking Details";
        $booking       =  DoctorAppointment::with(['doctors','schedules'])->where('slug',$slug)->first();
        $user          = auth()->user();
        $notifications = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();