app/Http/Controllers/User/SupportTicketController.php

insert into `support_tickets` (`name`, `email`, `subject`, `desc`, `token`, `user_id`, `status`, `type`, `created_at`) values ('Test User', 'user@appdevs.net', 'Deleniti est deserun', 'sell', 'xA7aCVusw1TTWc6a', 1, 3, 'USER', '2024-02-28 06:05:20')
---
    public function store(Request $request)
    {
        // dd($request->all());
        $validator = Validator::make($request->all(),[
            'name'              => "required|string|max:60",
            'email'             => "required|string|email|max:150",
            'subject'           => "required|string|max:255",
            'desc'              => "nullable|string|max:5000",
            'attachment'        => "required|array",
            'attachment.*'      => "required|file|max:204800",
        ]);
        $validated = $validator->validate();
        $validated['token']         = generate_unique_string('support_tickets','token',16);
        $validated['user_id']       = auth()->user()->id;
        $validated['status']        = 0;
        $validated['type']          = SupportTicketConst::TYPE_USER;
        $validated['created_at']    = now();
        $validated = Arr::except($validated,['attachment']);

        try{
            $support_ticket_id = SupportTicket::insertGetId($validated);

select * from `users` where `users`.`id` in (1)
---
            }
        }

        return redirect()->route('user.support.ticket.index')->with(['success' => ['Support ticket created successfully!']]);

select * from `support_tickets` where `support_tickets`.`id` = 2 limit 1
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 10
---
    public function conversation($encrypt_id)
    {
        $page_title        = "| Conversation";
        $breadcrumb        = "Conversation";
        $support_ticket_id = decrypt($encrypt_id);
        $support_ticket    = SupportTicket::findOrFail($support_ticket_id);
        $user              = auth::user();
        $notifications     = UserNotification::where('user_id',$user->id)->latest()->take(10)->get();

insert into `support_chats` (`support_ticket_id`, `sender`, `sender_type`, `message`, `receiver_type`, `updated_at`, `created_at`) values (2, 1, 'USER', 'hi', 'ADMIN', '2024-02-28 06:25:28', '2024-02-28 06:25:28')
---
    public function messageSend(Request $request) {
        // dd("test");
        $validator = Validator::make($request->all(),[
            'message'       => 'required|string|max:200',
            'support_token' => 'required|string',
        ]);
        if($validator->fails()) {
            return Response::error($validator->errors(),null,400);
        }
        $validated = $validator->validate();

        $support_ticket = SupportTicket::notSolved($validated['support_token'])->first();
        if(!$support_ticket) return Response::error(['error' => ['This support ticket is closed.']]);

        $data = [
            'support_ticket_id'         => $support_ticket->id,
            'sender'                    => auth()->user()->id,
            'sender_type'               => "USER",
            'message'                   => $validated['message'],
            'receiver_type'             => "ADMIN",
        ];

        try{
            $chat_data = SupportChat::create($data);