app/Http/Helpers/helpers.php

function system_super_admin()
{
    if (AdminHasRole::whereHas('role', function ($query) {
        $query->where("name", AdminRoleConst::SUPER_ADMIN);
    })->exists()) return true;
---
select exists(select * from `admin_has_roles` where exists (select * from `admin_roles` where `admin_has_roles`.`admin_role_id` = `admin_roles`.`id` and `name` = 'Super Admin')) as `exists`

function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();
---
select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')