app/Http/Helpers/PaymentGateway.php

    public function gateway() {
        $request_data = $this->request_data;

        if(empty($request_data)) throw new Exception("Gateway Information is not available. Please provide payment gateway currency alias");
        $validated = $this->validator($request_data)->validate();

        $temporary_data     = DoctorAppointment::where('slug',$validated['identifier'])->first();
        $gateway_currency   = PaymentGatewayCurrency::with(['gateway'])->where("alias",$validated['payment_method'])->first();
---
select * from `doctor_appointments` where `slug` = '58c0dae7-59ee-40cf-968e-545ce6103bb1' limit 1
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`payment_gateway_id` in (5003) order by `id` desc

    public function chargeCalculate($currency,$receiver_currency = null) {
        $temporary_data     = DoctorAppointment::where('slug',$this->request_data['identifier'])->first();
---
select * from `doctor_appointments` where `slug` = '58c0dae7-59ee-40cf-968e-545ce6103bb1' limit 1

    public function authenticateTempData(){
        $tempData = $this->request_data;

        if(empty($tempData) || empty($tempData['type'])) throw new Exception('Transaction failed. Record didn\'t saved properly. Please try again.');

        if($this->requestIsApiUser()) {
            $creator_table = $tempData['data']->creator_table ?? null;
            $creator_id = $tempData['data']->creator_id ?? null;
            $creator_guard = $tempData['data']->creator_guard ?? null;

            $api_authenticated_guards = PaymentGatewayConst::apiAuthenticateGuard();
            if(!array_key_exists($creator_guard,$api_authenticated_guards)) throw new Exception('Request user doesn\'t save properly. Please try again');

            if($creator_table == null || $creator_id == null || $creator_guard == null) throw new Exception('Request user doesn\'t save properly. Please try again');
            $creator = DB::table($creator_table)->where("id",$creator_id)->first();
            if(!$creator) throw new Exception("Request user doesn\'t save properly. Please try again");

            $api_user_login_guard = $api_authenticated_guards[$creator_guard];
            $this->output['api_login_guard'] = $api_user_login_guard;
            Auth::guard($api_user_login_guard)->loginUsingId($creator->id);
        }

        $currency_id = $tempData['data']->currency ?? "";

        $gateway_currency = PaymentGatewayCurrency::find($currency_id->id);
---
select * from `payment_gateway_currencies` where `payment_gateway_currencies`.`id` = 4 limit 1

    public function createTransaction($output, $status,$temp_remove = true) {

        $basic_setting = BasicSettings::first();
        $record_handler = $output['record_handler'];

        if($this->predefined_user) {
            $user = $this->predefined_user;
        }else {
            $user = auth()->guard(get_auth_guard())->user();
        }

        $inserted_id = $this->$record_handler($output,$status);
        $trx_id     = DoctorAppointment::where('id',$inserted_id)->first();

        $data = DoctorAppointment::with(['doctors','schedules'])->where('slug',$output['form_data']['identifier'])->first();
        $from_time        = $data->schedules->from_time ?? '';
        $parsed_from_time = Carbon::createFromFormat('H:i', $from_time)->format('h A');

        $to_time          = $data->schedules->to_time ?? '';
        $parsed_to_time   = Carbon::createFromFormat('H:i', $to_time)->format('h A');
        if(auth()->check()){
            UserNotification::create([
                'user_id'  => auth()->user()->id,
                'message'  => "Your appointment (Doctor: ".$data->doctors->name.",
                Day: ".$data->schedules->week->day.", Time: ".$parsed_from_time."-".$parsed_to_time.", Serial Number: ".$data->patient_number.") Successfully booked.",
            ]);
        }

        $trx_id     = Transaction::where('id',$inserted_id)->first();
---
select * from `basic_settings` limit 1
select * from `doctor_appointments` where `id` = 42 limit 1
select * from `doctor_appointments` where `slug` = '58c0dae7-59ee-40cf-968e-545ce6103bb1' limit 1
select * from `doctors` where `doctors`.`id` in (7)
insert into `user_notifications` (`user_id`, `message`, `updated_at`, `created_at`) values (1, '\"Your appointment (Doctor: Dr. Adam Davis,\r\n                Day: Monday, Time: 07 PM-08 PM, Serial Number: 11) Successfully booked.\"', '2024-03-08 10:34:07', '2024-03-08 10:34:07')
insert into `user_notifications` (`user_id`, `message`, `updated_at`, `created_at`) values (1, '\"Your appointment (Doctor: Dr. Rodrego,\r\n                Day: Monday, Time: 07 PM-09 PM, Serial Number: 2) Successfully booked.\"', '2024-02-29 06:00:00', '2024-02-29 06:00:00')
select * from `doctor_appointments` where `id` = 62 limit 1
select * from `transactions` where `id` = 42 limit 1

    public function insertRecord($output, $status) {
        $data  = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();

        if($this->predefined_user) {
            $user = $this->predefined_user;
        }else {
            $user = auth()->guard('web')->user();
        }
        $details                   = [
            'doctor_fees'       => $data->details->doctor_fees,
            'fixed_charge'      => $data->details->fixed_charge,
            'percent_charge'    => $data->details->percent_charge,
            'total_charge'      => $data->details->total_charge,
            'payable_amount'    => $data->details->payable_amount,
            'payment_method'    => $output['gateway']->name,
            'currency'          => get_default_currency_code(),
        ];


        DB::beginTransaction();
        try{
            $data->update([
                'status'          => $status,
                'details'         => $details,
                'callback_ref'    => $output['callback_ref'] ?? null,
            ]);
---
select * from `doctor_appointments` where `slug` = '58c0dae7-59ee-40cf-968e-545ce6103bb1' limit 1
update `doctor_appointments` set `status` = 1, `details` = '{\"doctor_fees\":4,\"fixed_charge\":2,\"percent_charge\":0.04,\"total_charge\":2.04,\"payable_amount\":6.04,\"payment_method\":\"SSLCommerz\",\"currency\":\"USD\"}', `callback_ref` = '3ATooV97xKuxDTl8hdoY3xrhHMbdOtQGexSMqsJYTvAVJyv79ZXPJXnvgdmy', `doctor_appointments`.`updated_at` = '2024-02-29 07:32:59' where `id` = 42

    public function insertRecordWeb($output, $status) {
        $data  = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();

        if($this->predefined_user) {
            $user = $this->predefined_user;
        }else {
            $user = auth()->guard('web')->user();
        }
        $details                   = [
            'doctor_fees'       => $data->details->doctor_fees,
            'fixed_charge'      => $data->details->fixed_charge,
            'percent_charge'    => $data->details->percent_charge,
            'total_charge'      => $data->details->total_charge,
            'payable_amount'    => $data->details->payable_amount,
            'payment_method'    => $output['gateway']->name,
            'currency'          => get_default_currency_code(),
        ];


        DB::beginTransaction();
        try{
            $data->update([
                'status'    => $status,
                'details'   => $details
            ]);
---
select * from `doctor_appointments` where `slug` = '009ffab1-6407-4fe2-88d1-c0be822bf25b' limit 1
update `doctor_appointments` set `status` = 1, `details` = '{\"doctor_fees\":5,\"fixed_charge\":2,\"percent_charge\":0.05,\"total_charge\":2.05,\"payable_amount\":7.05,\"payment_method\":\"Paypal\",\"currency\":\"USD\"}', `doctor_appointments`.`updated_at` = '2024-02-29 06:00:00' where `id` = 24

    public function removeTempData($output) {
        try{
            $id = $output['tempData']['id'];
            TemporaryData::find($id)->delete();
---
delete from `temporary_datas` where `id` = 36
select * from `temporary_datas` where `temporary_datas`.`id` = 36 limit 1

    public function searchWithReferenceInTransaction($reference) {

        $transaction = DB::table('doctor_appointments')->where('callback_ref',$reference)->first();
---
select * from `doctor_appointments` where `callback_ref` = '3ATooV97xKuxDTl8hdoY3xrhHMbdOtQGexSMqsJYTvAVJyv79ZXPJXnvgdmy' limit 1

    public function handleCallback($reference,$callback_data,$gateway_name) {

        if($reference == PaymentGatewayConst::CALLBACK_HANDLE_INTERNAL) {
            $gateway = PaymentGatewayModel::gateway($gateway_name)->first();
            $callback_response_receive_method = $this->getCallbackResponseMethod($gateway);
            return $this->$callback_response_receive_method($callback_data, $gateway);
        }


        $transaction = DoctorAppointment::where('callback_ref',$reference)->first();
---
select * from `doctor_appointments` where `callback_ref` = 'a9QzF9VT9zxU9PfHnH68964Yhk6aFsJlDgoCXH19iFDA69UegsxyHKyCrMUN' limit 1

    public function handleBtnPay($gateway, $request_data)
    {

        if(!array_key_exists('token', $request_data)) throw new Exception("Requested with invalid token");
        $temp_token = $request_data['token'];

        $temp_data = TemporaryData::where('identifier', $temp_token)->first();
---
select * from `temporary_datas` where `identifier` = 'XCtF6ezZ7V' limit 1