app/Http/Helpers/PaymentGateway.php

    public function authenticateTempData(){
        $tempData = $this->request_data;
        if(empty($tempData) || empty($tempData['type'])) throw new Exception('Transaction failed. Record didn\'t saved properly. Please try again.');
        $booking_data  = DoctorAppointment::where('slug',$tempData['data']->user_record)->first();
---
select * from `doctor_appointments` where `slug` = '57ca31ba-c472-483b-9c92-d1e6187dd0d4' limit 1

    public function createTransaction($output, $status,$temp_remove = true) {

        $basic_setting = BasicSettings::first();
---
select * from `basic_settings` limit 1

    public function insertRecordWeb($output, $status) {
        $data  = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();
---
select * from `doctor_appointments` where `slug` = '0e732ac4-b93b-4159-9242-89fd1dd495ad' limit 1

    public function removeTempData($output) {
        try{
            $id = $output['tempData']['id'];
            TemporaryData::find($id)->delete();
---
delete from `temporary_datas` where `id` = 44
select * from `temporary_datas` where `temporary_datas`.`id` = 44 limit 1