app/Http/Controllers/Api/V1/User/AppointmentBookingController.php

select * from `doctor_appointments` where `slug` = '82bbe1af-536a-4505-8112-b4f785854536' limit 1
select * from `doctors` where `doctors`.`id` in (7)
select * from `basic_settings` limit 1
---
    public function confirm(Request $request){
        $validator           = Validator::make($request->all(),[
            'payment_method' => 'required',
            'slug'     => 'required'
        ]);
        if($validator->fails()){
            return Response::error($validator->errors()->all(),[]);
        }
        $validated      = $validator->validate();

        $confirm_appointment = DoctorAppointment::with(['doctors','schedules'])->where('slug',$validated['slug'])->first();

        if(!$confirm_appointment) return Response::error(['Appointment not found!'],404);

        $from_time        = $confirm_appointment->schedules->from_time ?? '';
        $parsed_from_time = Carbon::createFromFormat('H:i', $from_time)->format('h A');

        $to_time          = $confirm_appointment->schedules->to_time ?? '';
        $parsed_to_time   = Carbon::createFromFormat('H:i', $to_time)->format('h A');
        $basic_setting    = BasicSettings::first();

select * from `temporary_datas` where `identifier` = 'a9QzF9VT9zxU9PfHnH68964Yhk6aFsJlDgoCXH19iFDA69UegsxyHKyCrMUN' limit 1
select * from `doctor_appointments` where `slug` = '0e732ac4-b93b-4159-9242-89fd1dd495ad' and `status` = 1 limit 1
---
    public function success(Request $request, $gateway){

        try{

            $token = PaymentGatewayHelper::getToken($request->all(),$gateway);

            $temp_data = TemporaryData::where("identifier",$token)->first();
            $booking_data = DoctorAppointment::where('slug',$temp_data->data->user_record)->where('status',false)->first();