app/Http/Controllers/Api/V1/User/ProfileController.php

select * from `weeks` where `weeks`.`id` = 3 limit 1
select * from `doctor_appointments` where `user_id` = 1
select * from `doctors` where `doctors`.`id` in (1, 2, 3, 4, 5)
select * from `users` where `users`.`id` in (1)
---
    public function history(){
        $booking    = DoctorAppointment::with(['doctors','schedules','user'])->where('user_id',auth()->user()->id)->where('status',true)->get()->map(function($data){
            $originalDate = $data->created_at;
            $formattedDate = Carbon::parse($originalDate);

            $date  = $formattedDate->format('d');
            $month = $formattedDate->format('F');
            $year  = $formattedDate->format('Y');
            return [
                'id'              => $data->id,
                'doctor_name'     => $data->doctors->name,
                'patient_name'    => $data->name,
                'patient_mobile'  => $data->phone,
                'patient_email'   => $data->email,
                'type'            => $data->type,
                'fees'            => get_amount($data->doctors->fees).' '.CurrencyProvider::default()->code,
                'day'             => $data->schedules->week->day,
                'from_time'       => $data->schedules->from_time,
                'to_time'         => $data->schedules->to_time,
                'details'         => $data->details,
                'prescription'    => $data->prescription,
                'status'          => $data->status,