app/Traits/PaymentGateway/Paypal.php

select * from `doctor_appointments` where `slug` = 'e8405dee-c919-44b3-a3a5-3cd7d7fe1633' limit 1
---
            foreach($response['links'] as $item) {
                if($item['rel'] == "approve") {
                    $output         = $this->output;
                    $booking_data   = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();