app/Traits/PaymentGateway/Razorpay.php

        if(auth()->check()){
            $user = User::where('id',$temp_data->data->creator_id)->first();
        }else{
            $user = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();
---
select * from `doctor_appointments` where `slug` = '35555a2a-6d77-4fa1-8f9f-f2e7cd8c5d02' limit 1