app/Traits/PaymentGateway/SslCommerz.php

    public function createSslCommerzPaymentLink($output, $request_credentials)
    {
        $v4 = $this->sslCommerz_api_v4;
        $endpoint = "gwprocess/$v4/api.php";
        $endpoint = $request_credentials->base_url . $endpoint;

        $temp_record_token = generate_unique_string('temporary_datas','identifier',60);
        $this->setUrlParams("token=" . $temp_record_token); // set Parameter to URL for identifying when return success/cancel

        $redirection = $this->getRedirection();
        $url_parameter = $this->getUrlParams();

        if(auth()->check()){
            $user = auth()->guard(get_auth_guard())->user();
        }else{
            $user  = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();
        }
        $booking_data   = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();
---
select * from `doctor_appointments` where `slug` = '6651c0d5-1d31-4284-8963-0ed66d256d2f' limit 1
select * from `doctor_appointments` where `slug` = '82bbe1af-536a-4505-8112-b4f785854536' limit 1