app/Traits/PaymentGateway/Stripe.php

select * from `doctor_appointments` where `slug` = 'f7e5a8b1-65b0-4359-8fa0-4ebb2ee2a502' limit 1
---
    public function createStripeCheckout($output) {

        $request_credentials = $this->getStripeRequestCredentials($output);

        $stripe_client = new StripeClient($request_credentials->token);

        $temp_record_token = generate_unique_string('temporary_datas','identifier',60);
        $this->setUrlParams("token=" . $temp_record_token); // set Parameter to URL for identifying when return success/cancel

        $redirection = $this->getRedirection();
        $url_parameter = $this->getUrlParams();
        if(auth()->check()){
            $user = auth()->guard(get_auth_guard())->user();
        }else{
            $user  = DoctorAppointment::where('slug',$output['form_data']['identifier'])->first();