app/Http/Controllers/Frontend/AppointmentBookingController.php

    public function appointmentBooking($slug){

        $page_title                 = "| Appointment Booking";
        $contact_section_slug       = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact                    = SiteSections::getData($contact_section_slug)->first();
        $doctor                     = Doctor::with(['schedules'])->where('slug',$slug)->first();
        if(!$doctor) abort(404);
        $footer_section_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                     = SiteSections::getData($footer_section_slug)->first();
        $app_settings               = AppSettings::first();
        $news_letter_section        = Str::slug(SiteSectionConst::NEWSLETTER_SECTION);
        $news_letter                = SiteSections::getData($news_letter_section)->first();
        $validated_user             = auth()->user();
        $useful_links               = UsefulLink::where('status',true)->get();
---
select * from `doctors` where `slug` = 'e67624bb-9d5f-4140-bea0-dd8d4938cd82' limit 1
select * from `app_settings` limit 1
select * from `useful_links` where `status` = 1

    public function store(Request $request){
        $validator     = Validator::make($request->all(),[
            'doctor'   => 'required',
            'schedule' => 'required',
            'name'     => 'required|string',
            'phone'    => 'nullable',
            'email'    => 'required|email',
            'age'      => 'required|string',
            'age_type' => 'required|string',
            'type'     => 'required',
            'gender'   => 'required',
            'message'  => 'nullable',
        ]);

        if($validator->fails()){
            return back()->withErrors($validator)->withInput($request->all());
        }

        $validated          = $validator->validate();
        $age_type           = $request->age_type;
        $validated['age']   = $request->age.' '.$age_type;
        $validated['slug']  = Str::uuid();
        $slug               = $validated['doctor'];
        $find_doctor        = Doctor::where('slug',$slug)->first();
        if(!$find_doctor) return back()->with(['error' =>  ['Doctor not found!']]);

        $transaction_fees   = TransactionSetting::where('slug','appointment')->first();
---
select * from `doctors` where `slug` = '6abba95f-eca9-424d-b8a3-4a7a7ab6d2ca' limit 1
select * from `transaction_settings` where `slug` = 'appointment' limit 1


        $validated['doctor_id']   = $find_doctor->id;

        $schedule = DoctorHasSchedule::where('id',$validated['schedule'])->whereHas('doctor',function($q) use ($find_doctor) {
            $q->where('id',$find_doctor->id);
        })->first();
---
select * from `doctors` where `doctors`.`id` in (8)
select * from `doctor_has_schedules` where `id` = '12' and exists (select * from `doctors` where `doctor_has_schedules`.`doctor_id` = `doctors`.`id` and `id` = 7) limit 1


        $validated['schedule_id'] = $validated['schedule'];

        $already_appointed_patient = DoctorAppointment::where('doctor_id',$find_doctor->id)->where('schedule_id',$validated['schedule_id'])->count();
---
select count(*) as aggregate from `doctor_appointments` where `doctor_id` = 7 and `schedule_id` = '12'

        $validated['details']        = $data;

        try{
           $patient_slug = DoctorAppointment::create($validated);
---
insert into `doctor_appointments` (`name`, `phone`, `email`, `age`, `type`, `gender`, `message`, `slug`, `user_id`, `site_type`, `authenticated`, `doctor_id`, `schedule_id`, `patient_number`, `details`, `updated_at`, `created_at`) values ('Zoe Clayton', '+1 (756) 808-9515', 'gyhihep@mailinator.com', '50 Days', 'REPORT', 'MALE', 'Qui molestias exerci', '\"697278bb-d321-4663-9218-0cc09f7e65b1\"', '', 'web', 0, 7, '12', 1, '{\"doctor_fees\":4,\"fixed_charge\":2,\"percent_charge\":0.04,\"total_charge\":2.04,\"payable_amount\":6.04}', '2024-03-12 06:39:18', '2024-03-12 06:39:18')

    public function preview($slug){

        $page_title                 = "| Appointment Booking Preview";
        $contact_section_slug       = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact                    = SiteSections::getData($contact_section_slug)->first();
        $footer_section_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                     = SiteSections::getData($footer_section_slug)->first();
        $app_settings               = AppSettings::first();
        $patient                    = DoctorAppointment::with(['doctors','schedules'])->where('slug',$slug)->first();
        $useful_links               = UsefulLink::where('status',true)->get();
        $news_letter_section        = Str::slug(SiteSectionConst::NEWSLETTER_SECTION);
        $news_letter                = SiteSections::getData($news_letter_section)->first();
        $payment_gateway            = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::payment_method_slug());
            $gateway->where('status', 1);
        })->get();
---
select * from `app_settings` limit 1
select * from `doctor_appointments` where `slug` = '95691ff8-17c4-43ef-ba5a-e385935d6f98' limit 1
select * from `doctors` where `doctors`.`id` in (2)
select * from `useful_links` where `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'payment-method' and `status` = 1)

    public function confirm(Request $request,$slug){

        $confirm_appointment = DoctorAppointment::with(['doctors','schedules'])->where('slug',$slug)->first();

        if(!$confirm_appointment) return back()->with(['error' => ['Appointment not found!']]);

        $from_time        = $confirm_appointment->schedules->from_time ?? '';
        $parsed_from_time = Carbon::createFromFormat('H:i', $from_time)->format('h A');

        $to_time          = $confirm_appointment->schedules->to_time ?? '';
        $parsed_to_time   = Carbon::createFromFormat('H:i', $to_time)->format('h A');
        $basic_setting    = BasicSettings::first();
---
select * from `doctor_appointments` where `slug` = '8de66a5e-c086-4257-a7ed-2bc84847e214' limit 1
select * from `doctors` where `doctors`.`id` in (1)
select * from `basic_settings` limit 1

                    'details'   => $data,
                ]);
                if(auth()->check()){
                    UserNotification::create([
                        'user_id'  => auth()->user()->id,
                        'message'  => "Your appointment (Doctor: ".$confirm_appointment->doctors->name.",
                        Day: ".$confirm_appointment->schedules->week->day.", Time: ".$parsed_from_time."-".$parsed_to_time.", Serial Number: ".$confirm_appointment->patient_number.") Successfully booked.",
                    ]);
---
insert into `user_notifications` (`user_id`, `message`, `updated_at`, `created_at`) values (1, '\"Your appointment (Doctor: Dr. Cuti Romero,\n                        Day: Tuesday, Time: 05 PM-07 PM, Serial Number: 1) Successfully booked.\"', '2024-02-29 06:47:34', '2024-02-29 06:47:34')

    public function success(Request $request, $gateway){
        try{

            $token = PaymentGatewayHelper::getToken($request->all(),$gateway);

            $temp_data = TemporaryData::where("identifier",$token)->first();
            $booking_data = DoctorAppointment::where('slug',$temp_data->data->user_record)->where('status',false)->first();
            $booking_data_confirm = DoctorAppointment::where('slug',$temp_data->data->user_record)->where('status',true)->first();

            if($booking_data_confirm) return back()->with(['error' => ['Already confirm the booking.']]);


            if(DoctorAppointment::where('callback_ref', $token)->exists()) {
---
select * from `temporary_datas` where `identifier` = 'cEMWel8XAbRKOfXOOGxqBcdkSmBluCmqnyFksBvJHaF88FakwCK65haKFSx6' limit 1
select * from `doctor_appointments` where `slug` = '57ca31ba-c472-483b-9c92-d1e6187dd0d4' and `status` = 0 limit 1
select * from `doctor_appointments` where `slug` = '57ca31ba-c472-483b-9c92-d1e6187dd0d4' and `status` = 1 limit 1
select exists(select * from `doctor_appointments` where `callback_ref` = 'cEMWel8XAbRKOfXOOGxqBcdkSmBluCmqnyFksBvJHaF88FakwCK65haKFSx6') as `exists`

    public function cancel(Request $request, $gateway) {
        if($request->has('token')) {
            $identifier = $request->token;
            if($temp_data = TemporaryData::where('identifier', $identifier)->first()) {
---
select * from `temporary_datas` where `identifier` = '3ATooV97xKuxDTl8hdoY3xrhHMbdOtQGexSMqsJYTvAVJyv79ZXPJXnvgdmy' limit 1

    public function redirectUsingHTMLForm(Request $request, $gateway)
    {
        $temp_data = TemporaryData::where('identifier', $request->token)->first();
---
select * from `temporary_datas` where `identifier` = '81b02d2e-5c91-463b-9b51-972df191b97a-1709894361' limit 1