app/Http/Controllers/Frontend/HomeServiceController.php

select * from `useful_links` where `status` = 1
select * from `investigations` where `status` = 1 and `home_service` = 1
select * from `app_settings` limit 1
---
    public function index(){
        $page_title                 = "| Home Services";
        $useful_links               = UsefulLink::where('status',true)->get();
        $hospital_tests             = Investigation::where('status',true)->where('home_service',true)->get();
        $contact_section_slug       = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact                    = SiteSections::getData($contact_section_slug)->first();
        $footer_section_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                     = SiteSections::getData($footer_section_slug)->first();
        $app_settings               = AppSettings::first();