app/Http/Controllers/Frontend/SiteController.php

    public function index(){

        $contact_section_slug       = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact                    = SiteSections::getData($contact_section_slug)->first();
        $banner_slug                = Str::slug(SiteSectionConst::BANNER_SECTION);
        $banner                     = SiteSections::getData($banner_slug)->first();
        $login_slug                 = Str::slug(SiteSectionConst::LOG_IN_SECTION);
        $login                      = SiteSections::getData($login_slug)->first();
        $register_slug              = Str::slug(SiteSectionConst::REGISTER_SECTION);
        $register                   = SiteSections::getData($register_slug)->first();
        $section_slug               = Str::slug(SiteSectionConst::ABOUT_SECTION);
        $about                      = SiteSections::getData($section_slug)->first();
        $faq_section_slug           = Str::slug(SiteSectionConst::FAQ_SECTION);
        $faq                        = SiteSections::getData($faq_section_slug)->first();
        $testimonial_section_slug   = Str::slug(SiteSectionConst::TESTIMONIAL_SECTION);
        $testimonial                = SiteSections::getData($testimonial_section_slug)->first();
        $how_its_work_section_slug  = Str::slug(SiteSectionConst::HOW_ITS_WORK);
        $how_its_work               = SiteSections::getData($how_its_work_section_slug)->first();
        $journal_section_slug       = Str::slug(SiteSectionConst::WEB_JOURNAL);
        $journal_top                = SiteSections::getData($journal_section_slug)->first();
        $journals                   = Journal::where('status',true)->get();
        $news_letter_section        = Str::slug(SiteSectionConst::NEWSLETTER_SECTION);
        $news_letter                = SiteSections::getData($news_letter_section)->first();
        $footer_section_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                     = SiteSections::getData($footer_section_slug)->first();
        $app_settings               = AppSettings::first();
        $hospital_departments       = HospitalDepartment::where('status',true)->get();
        $branches                   = HospitalBranch::where('status',true)->get();
        $useful_links               = UsefulLink::where('status',true)->get();
        $hospital_tests             = Investigation::where('status',true)->get();
---
select * from `journals` where `status` = 1
select * from `app_settings` limit 1
select * from `hospital_departments` where `status` = 1
select * from `hospital_branches` where `status` = 1
select * from `useful_links` where `status` = 1
select * from `investigations` where `status` = 1

    public function doctors(){

        $page_title                 = "| Find Doctor";
        $login_slug                 = Str::slug(SiteSectionConst::LOG_IN_SECTION);
        $login                      = SiteSections::getData($login_slug)->first();
        $register_slug              = Str::slug(SiteSectionConst::REGISTER_SECTION);
        $register                   = SiteSections::getData($register_slug)->first();
        $doctors                    = Doctor::where('status',true)->inRandomOrder()->get();
        $contact_section_slug       = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact                    = SiteSections::getData($contact_section_slug)->first();
        $branches                   = HospitalBranch::where('status',true)->get();
        $departments                = HospitalDepartment::where('status',true)->get();
        $footer_section_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                     = SiteSections::getData($footer_section_slug)->first();
        $app_settings               = AppSettings::first();
        $news_letter_section        = Str::slug(SiteSectionConst::NEWSLETTER_SECTION);
        $news_letter                = SiteSections::getData($news_letter_section)->first();
        $useful_links               = UsefulLink::where('status',true)->get();
---
select * from `doctors` where `status` = 1 order by RAND()
select * from `hospital_branches` where `status` = 1
select * from `hospital_departments` where `status` = 1
select * from `app_settings` limit 1
select * from `useful_links` where `status` = 1

    public function journals(){

        $page_title                 = "| Web Journal";
        $login_slug                 = Str::slug(SiteSectionConst::LOG_IN_SECTION);
        $login                      = SiteSections::getData($login_slug)->first();
        $register_slug              = Str::slug(SiteSectionConst::REGISTER_SECTION);
        $register                   = SiteSections::getData($register_slug)->first();
        $contact_section_slug       = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact                    = SiteSections::getData($contact_section_slug)->first();
        $journal                    = Journal::where('status',true)->paginate(6);
        $footer_section_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                     = SiteSections::getData($footer_section_slug)->first();
        $app_settings               = AppSettings::first();
        $news_letter_section        = Str::slug(SiteSectionConst::NEWSLETTER_SECTION);
        $news_letter                = SiteSections::getData($news_letter_section)->first();
        $useful_links               = UsefulLink::where('status',true)->get();
---
select * from `journals` where `status` = 1 limit 6 offset 0
select count(*) as aggregate from `journals` where `status` = 1
select * from `app_settings` limit 1
select * from `useful_links` where `status` = 1