app/Models/SupportTicket.php

    public function getCreatorAttribute() {
        if($this->type == SupportTicketConst::TYPE_USER) {
            return $this->user()->first();
---
select * from `users` where `users`.`id` = 1 limit 1