app/Http/Controllers/Admin/AppointmentBookingController.php

select * from `doctor_appointments` where `status` = 1 order by `id` desc limit 10 offset 0
select * from `doctors` where `doctors`.`id` in (1, 2, 3, 4, 5)
select count(*) as aggregate from `doctor_appointments` where `status` = 1
---
    public function index(){

        $page_title    = "Appointments";
        $booking_appointments = DoctorAppointment::with(['doctors'])->where('status',true)->orderByDesc("id")->paginate(10);

select * from `doctor_appointments` where `slug` = '1f90a524-d1c5-4f2b-80da-4c944c978ce2' limit 1
select * from `doctors` where `doctors`.`id` in (2)
---
    public function bookingDetails($slug){
        $page_title       = "Booking Details";
        $appointment      = DoctorAppointment::with(['doctors','schedules'])->where('slug',$slug)->first();

select * from `doctor_appointments` where `slug` = 'fe1455ca-9bda-40db-9ec8-abf1b52185d7' limit 1
select * from `doctors` where `doctors`.`id` in (4)
select * from `users` where `users`.`id` in (1)
update `doctor_appointments` set `prescription` = 'prescription-2023-11-04.pdf', `doctor_appointments`.`updated_at` = '2023-11-04 11:40:12' where `id` = 17
insert into `user_notifications` (`user_id`, `message`, `updated_at`, `created_at`) values (1, '\"Prescription sent for (Patient:Emily Johnson)(Doctor: Dr. Iris Hanson)\"', '2023-11-05 04:48:00', '2023-11-05 04:48:00')
---
    public function prescriptionUpload(Request $request,$slug){
        $data           = DoctorAppointment::with(['doctors','schedules','user'])->where('slug',$slug)->first();
        $validator      = Validator::make($request->all(),[
            'prescription'      => 'required',
        ]);
        $validated      = $validator->validate();

        try{
            if($request->hasFile('prescription')) {
                $file_name = 'prescription-'.Carbon::parse(now())->format("Y-m-d") . "." .$validated['prescription']->getClientOriginalExtension();
                $file_link = get_files_path('prescription-file') . '/' . $file_name;

                (new Filesystem)->cleanDirectory(get_files_path('prescription-file'));
                File::move($validated['prescription'],$file_link);
                $data->update([
                    'prescription'      => $file_name,
                ]);
                UserNotification::create([
                    'user_id'   => $data->user_id,
                    'message'   => "Prescription sent for (Patient:" .$data->name .")". "(Doctor: ".$data->doctors->name.")",

                ]);

select * from `doctor_appointments` where `slug` = '5031b63c-52b4-4e8b-be3a-337072dc3232' limit 1
---
    public function downloadPrescription($slug)
    {
        $data = DoctorAppointment::where('slug', $slug)->first();