app/Http/Controllers/Admin/CurrencyController.php

select * from `currencies` order by `default` desc limit 10 offset 0
select count(*) as aggregate from `currencies`
---
    public function index()
    {
        $page_title = "Setup Currency";
        $currencies = Currency::orderByDesc('default')->paginate(10);