app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `email_verified` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `journals`
select count(*) as aggregate from `journals` where `status` = 1
select count(*) as aggregate from `journals` where `status` = 0
select count(*) as aggregate from `hospital_branches`
select count(*) as aggregate from `hospital_branches` where `status` = 1
select count(*) as aggregate from `hospital_branches` where `status` = 0
---
    public function index()
    {
        $page_title = "Dashboard";

        $total_user = (User::toBase()->count() == 0) ? 1 : User::toBase()->count();
        $unverified_user = User::toBase()->where('email_verified', 0)->count();
        $active_user = User::toBase()->where('status', true)->count();
        $banned_user = User::toBase()->where('status', false)->count();
        $user_percent =(($active_user * 100) / $total_user);

        if($user_percent > 100){
            $user_percent = 100;
        }

        $total_journals   = Journal::toBase()->count();
        $active_journal   = Journal::toBase()->where('status',true)->count();
        $pending_journal = Journal::toBase()->where('status',false)->count();
        $journal_percent  = (($active_journal *100) / $total_journals);

        if($journal_percent > 100){
            $journal_percent = 100;
        }

        $total_branches      = (HospitalBranch::toBase()->count() == 0) ? 1 : HospitalBranch::toBase()->count();
        $active_branches     = HospitalBranch::toBase()->where('status',true)->count();
        $pending_branches    = HospitalBranch::toBase()->where('status',false)->count();

select count(*) as aggregate from `hospital_departments`
select count(*) as aggregate from `hospital_departments` where `status` = 1
select count(*) as aggregate from `hospital_departments` where `status` = 0
---
            $branch_percent = 100;
        }

        $total_departments    = (HospitalDepartment::toBase()->count() == 0) ? 1 : HospitalDepartment::toBase()->count();
        $active_departments   = HospitalDepartment::toBase()->where('status',true)->count();
        $pending_departments  = HospitalDepartment::toBase()->where('status',false)->count();

select count(*) as aggregate from `investigations`
select count(*) as aggregate from `investigations` where `status` = 1
select count(*) as aggregate from `investigations` where `status` = 0
---
            $total_departments = 100;
        }

        $total_hospital_tests   = (Investigation::toBase()->count() ==0 ) ? 1 : Investigation::toBase()->count();
        $active_hospital_tests  = Investigation::toBase()->where('status',true)->count();
        $pending_hospital_tests = Investigation::toBase()->where('status',false)->count();

select count(*) as aggregate from `health_packages`
select count(*) as aggregate from `health_packages` where `status` = 1
select count(*) as aggregate from `health_packages` where `status` = 0
---
            $hospital_test_percent = 100;
        }

        $total_packages         = (HealthPackage::toBase()->count() == 0) ? 1 : HealthPackage::toBase()->count();
        $active_packages        = HealthPackage::toBase()->where('status',true)->count();
        $pending_packages       = HealthPackage::toBase()->where('status',false)->count();

select count(*) as aggregate from `doctors`
select count(*) as aggregate from `doctors` where `status` = 1
select count(*) as aggregate from `doctors` where `status` = 0
---
            $package_percent = 100;
        }

        $total_doctors          = (Doctor::toBase()->count() == 0) ? 1 : Doctor::toBase()->count();
        $active_doctors         = Doctor::toBase()->where('status',true)->count();
        $pending_doctors        = Doctor::toBase()->where('status',false)->count();

select count(*) as aggregate from `doctor_appointments`
select count(*) as aggregate from `doctor_appointments` where `status` = 1
select count(*) as aggregate from `doctor_appointments` where `status` = 0
---
            $doctor_percent = 100;
        }

        $appointment_booking    = (DoctorAppointment::toBase()->count() == 0) ? 1 : DoctorAppointment::toBase()->count();
        $active_appointment     = DoctorAppointment::toBase()->where('status',true)->count();
        $pending_appointment    = DoctorAppointment::toBase()->where('status',false)->count();

select count(*) as aggregate from `home_test_services`
select count(*) as aggregate from `home_test_services` where `status` = 1
select count(*) as aggregate from `home_test_services` where `status` = 0
---
            $appointment_percent = 100;
        }

        $total_home_service     = (HomeTestService::toBase()->count() == 0) ? 1 : HomeTestService::toBase()->count();
        $active_home_service    = HomeTestService::toBase()->where('status',true)->count();
        $pending_home_service   = HomeTestService::toBase()->where('status',false)->count();

select * from `doctor_appointments` where `status` = 1 order by `created_at` desc limit 5
select * from `doctors` where `doctors`.`id` in (7)
---

        ];

        $recent_appointment = DoctorAppointment::with(['doctors'])->where('status',true)->latest()->take(5)->get();