app/Http/Controllers/Admin/DoctorCareController.php

select * from `doctors` where `doctors`.`id` = '1' limit 1
update `doctors` set `status` = 0, `doctors`.`updated_at` = '2024-03-08 11:48:02' where `id` = 1
---
    public function statusUpdate(Request $request){

        $validator = Validator::make($request->all(),[
            'data_target'  => 'required|numeric|exists:doctors,id',
            'status'       => 'required|boolean',
        ]);

        if($validator->fails()){
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();
        $doctors = Doctor::find($validated['data_target']);

        try {
            $doctors->update([
                'status'   => ($validated['status']) ? false: true,
            ]);

select * from `doctors` where `doctors`.`id` = '3' limit 1
select * from `hospital_branches` where `status` = 1 order by `name` asc
select * from `hospital_departments` where `status` = 1
select * from `weeks`
select * from `doctor_has_schedules` where `doctor_id` = '3'
---
    public function edit($id){
        $page_title          = "Doctor Edit";
        $doctors             = Doctor::find($id);
        if(!$doctors) return back()->with(['error' => ["Doctor Does not exists"]]);

        $hospital_branch     = HospitalBranch::where('status',true)->orderBy('name','ASC')->get();
        $hospital_department = HospitalDepartment::where('status',true)->get();
        $weeks               = Week::get();
        $doctor_has_schedule = DoctorHasSchedule::where('doctor_id',$id)->get();