app/Http/Controllers/Admin/HealthPackageController.php

select * from `health_packages` where `health_packages`.`id` = '8' limit 1
update `health_packages` set `status` = 1, `health_packages`.`updated_at` = '2024-03-08 11:49:33' where `id` = 8
---
    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:health_packages,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();


        $hospital_departments = HealthPackage::find($validated['data_target']);

        try{
            $hospital_departments->update([
                'status'        => ($validated['status']) ? false : true,
            ]);