app/Http/Controllers/Admin/HospitalDepartmentController.php

select * from `hospital_departments` where `hospital_departments`.`id` = '19' limit 1
update `hospital_departments` set `status` = 0, `hospital_departments`.`updated_at` = '2024-03-08 11:46:11' where `id` = 19
---
    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:hospital_departments,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();


        $hospital_departments = HospitalDepartment::find($validated['data_target']);

        try{
            $hospital_departments->update([
                'status'        => ($validated['status']) ? false : true,
            ]);