app/Http/Controllers/Admin/HospitalBranchController.php

    public function index(){
        $page_title           = "Hospital Branch";
        $hospital_branch = HospitalBranch::orderByDesc("id")->get();
---
select * from `hospital_branches` order by `id` desc

    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:hospital_branches,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();


        $hospital_departments = HospitalBranch::find($validated['data_target']);

        try{
            $hospital_departments->update([
                'status'        => ($validated['status']) ? false : true,
            ]);
---
select * from `hospital_branches` where `hospital_branches`.`id` = '5' limit 1
update `hospital_branches` set `status` = 1, `hospital_branches`.`updated_at` = '2024-03-08 11:47:32' where `id` = 5