app/Http/Controllers/Admin/LanguageController.php

    public function index()
    {
        $page_title = "Language Manager";
        $languages = Language::paginate(10);
---
select * from `languages` limit 10 offset 0
select count(*) as aggregate from `languages`

    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:languages,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();

        if(Language::whereNot("id",$validated['data_target'])->default()->exists()) {
            $warning = ['warning' => ['Please deselect your default language first.']];
            return Response::warning($warning);
        }

        $language = Language::find($validated['data_target']);
---
select exists(select * from `languages` where not `id` = '1' and `status` = 1) as `exists`
select * from `languages` where `languages`.`id` = '1' limit 1

    public function info($code) {

        $language = Language::where("code",$code);

        if(!$language->exists()) {
            return back()->with(['error' => ['Sorry! Language not found!']]);
        }

        $file = lang_path($code.".json");
        if(!is_file($file)) {
            return back()->with(['error' => ['Something went wrong! Please try again.']]);
        }

        $data = file_get_contents($file);
        try{
            $key_value = json_decode($data,true);
        }catch(Exception $e) {
            return back()->with(['error' => ['Something went wrong! Please try again.']]);
        }

        $language = $language->first();
---
select exists(select * from `languages` where `code` = 'en') as `exists`
select * from `languages` where `code` = 'en' limit 1

    public function switch(Request $request) {
        $code = $request->target;
        $language = Language::where("code",$code);
        if(!$language->exists()) {
---
select exists(select * from `languages` where `code` = 'ar') as `exists`