app/Http/Controllers/Admin/PaymentGatewaysController.php

insert into `payment_gateway_currencies` (`alias`, `created_at`, `currency_code`, `currency_symbol`, `fixed_charge`, `image`, `max_limit`, `min_limit`, `name`, `payment_gateway_id`, `percent_charge`, `rate`, `updated_at`) values ('payment-method-alec-elliott-dolore-automatic', '2024-02-22 09:30:30', 'Dolore', '$', '1.0000000000000000', '', '1.0000000000000000', '1.0000000000000000', 'Alec Elliott Dolore', 5009, '2.0000000000000000', '1.0000000000000000', '2024-02-22 09:30:30') on duplicate key update `min_limit` = values(`min_limit`), `max_limit` = values(`max_limit`), `fixed_charge` = values(`fixed_charge`), `percent_charge` = values(`percent_charge`), `rate` = values(`rate`), `currency_symbol` = values(`currency_symbol`), `currency_code` = values(`currency_code`), `name` = values(`name`), `alias` = values(`alias`), `payment_gateway_id` = values(`payment_gateway_id`), `image` = values(`image`), `updated_at` = values(`updated_at`)
---
        }

        try{
            PaymentGatewayCurrency::where('payment_gateway_id',$gateway->id)->upsert($data_ready_to_work,['alias']);