app/Http/Controllers/Admin/SetupSectionsController.php

select * from `languages`
---
    public function __construct()
    {
        $this->languages = Language::get();

select * from `site_sections` where `key` = 'news-letter-section' limit 1
---
        }
        // dd($data);
        try{
            SiteSections::updateOrCreate(['key' => $slug],[
                'key'   => $slug,
                'value' => $data,
            ]);

select * from `site_sections` where `key` = 'contact-section' limit 1
---
    public function newsLetterUpdate(Request $request,$slug) {

        $basic_field_name    = [
            'title'          => 'required|string|max:100',
            'description'    => 'required|string',

        ];
        $slug           = Str::slug(SiteSectionConst::NEWSLETTER_SECTION);
        $section        = SiteSections::where("key",$slug)->first();
        if($section != null ){
            $data       = json_decode(json_encode($section->value),true);
        }else{
            $data       = [];
        }

        $data['language']      = $this->contentValidate($request,$basic_field_name);
        $update_data['key']    = $slug;
        $update_data['value']  = $data;
        // dd($update_data);
        try{
            SiteSections::updateOrCreate(['key'=>$slug],$update_data);