app/Http/Controllers/Admin/SetupPagesController.php

select * from `setup_pages`
---
    public function index()
    {
        $page_title = "Setup Pages";
        $setup_pages = SetupPage::get();

select * from `setup_pages` where `slug` = 'home' limit 1
update `setup_pages` set `status` = 1, `setup_pages`.`updated_at` = '2024-03-12 04:30:08' where `id` = 13
---
    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error,null,400);
        }
        $validated = $validator->safe()->all();
        $page_slug = $validated['data_target'];

        $page = SetupPage::where('slug',$page_slug)->first();
        if(!$page) {
            $error = ['error' => ['Page not found!']];
            return Response::error($error,null,404);
        }

        try{
            $page->update([
                'status' => ($validated['status'] == true) ? false : true,
            ]);