app/Http/Controllers/Admin/SubscribeController.php

    public function index()
    {
        $page_title  = "Website Subscribers";
        $subscribers = Subscribe::orderByDesc("id")->paginate(10);
---
select count(*) as aggregate from `subscribes`