app/Http/Controllers/Admin/SupportTicketController.php

    public function index()
    {
        $page_title = "All Ticket";
        $support_tickets = SupportTicket::orderByDesc("id")->get();
---
select * from `support_tickets` order by `id` desc

    public function conversation($encrypt_id) {
        $support_ticket_id = decrypt($encrypt_id);
        $support_ticket = SupportTicket::findOrFail($support_ticket_id);
---
select * from `support_tickets` where `support_tickets`.`id` = 1 limit 1