app/Http/Controllers/Admin/TrxSettingsController.php

select * from `transaction_settings` where `slug` = 'appointment' limit 1
---
    public function index()
    {
        $page_title = "Fees & Charges";
        $transaction_charges = TransactionSetting::where('slug','appointment')->first();

select * from `transaction_settings` where `slug` = 'appointment' limit 1
update `transaction_settings` set `fixed_charge` = '10', `percent_charge` = '11', `transaction_settings`.`updated_at` = '2024-02-22 11:11:51' where `id` = 5
---
    public function trxChargeUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'slug'                              => 'required|string',
            $request->slug.'_fixed_charge'      => 'required|numeric',
            $request->slug.'_percent_charge'    => 'required|numeric',

        ]);
        $validated = $validator->validate();

        $transaction_setting = TransactionSetting::where('slug',$request->slug)->first();

        if(!$transaction_setting) return back()->with(['error' => ['Transaction charge not found!']]);
        $validated = replace_array_key($validated,$request->slug."_");

        try{
            $transaction_setting->update($validated);